{
  "meals": [
    {
      "idMeal": "52909",
      "strMeal": "Tarte Tatin",
      "strCategory": "Dessert",
      "strInstructions": "Roll the pastry to a 3mm-thick round on a lightly floured surface and cut a 24cm circle, using a plate as a guide. Lightly prick all over with a fork, wrap in cling film on a baking sheet and freeze while preparing the apples.\r\nHeat oven to 180C/160C fan/gas 4. Peel, quarter and core the apples. Put the sugar in a flameproof 20cm ceramic Tatin dish or a 20cm ovenproof heavy-based frying pan and place over a medium-high heat. Cook the sugar for 5-7 mins to a dark amber caramel syrup that’s starting to smoke, then turn off the heat and stir in the 60g diced chilled butter.\r\nTo assemble the Tarte Tatin, arrange the apple quarters very tightly in a circle around the edge of the dish first, rounded-side down, then fill in the middle in a similar fashion. Gently press with your hands to ensure there are no gaps. Brush the fruit with the melted butter.\r\nBake in the oven for 30 mins, then remove and place the disc of frozen puff pastry on top – it will quickly defrost. Tuck the edges down the inside of the dish and, with a knife, prick a few holes in the pastry to allow steam to escape. Bake for a further 40-45 mins until the pastry is golden brown and crisp.\r\nAllow to cool to room temperature for 1 hr before running a knife around the edge of the dish and inverting it onto a large serving plate that is deep enough to contain the juices. Serve with crème fraîche or vanilla ice cream.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ryspuw1511786688.jpg",
      "strYoutube": "https://www.youtube.com/watch?v=8xDM8U6h9Pw",
      "strIngredient1": "Puff Pastry",
      "strIngredient2": "Plain Flour",
      "strIngredient3": "Braeburn Apples",
      "strIngredient4": "Caster Sugar",
      "strIngredient5": "Butter",
      "strIngredient6": "Creme Fraiche",
      "strIngredient7": "",
      "strIngredient8": "",
      "strIngredient9": "",
      "strIngredient10": "",
      "strIngredient11": "",
      "strIngredient12": "",
      "strIngredient13": "",
      "strIngredient14": "",
      "strIngredient15": "",
      "strMeasure1": "300g",
      "strMeasure2": "Dusting",
      "strMeasure3": "6",
      "strMeasure4": "100g ",
      "strMeasure5": "85g",
      "strMeasure6": "to serve",
      "strMeasure7": "",
      "strMeasure8": "",
      "strMeasure9": "",
      "strMeasure10": "",
      "strMeasure11": "",
      "strMeasure12": "",
      "id": 1
    },
    {
      "idMeal": "52894",
      "strMeal": "Battenberg Cake",
      "strCategory": "Dessert",
      "strInstructions": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg",
      "strYoutube": "https://www.youtube.com/watch?v=aB41Q7kDZQ0",
      "strIngredient1": "Butter",
      "strIngredient2": "Caster Sugar",
      "strIngredient3": "Self-raising Flour",
      "strIngredient4": "Almonds",
      "strIngredient5": "Baking Powder",
      "strIngredient6": "Eggs",
      "strIngredient7": "Vanilla Extract",
      "strIngredient8": "Almond Extract",
      "strIngredient9": "Butter",
      "strIngredient10": "Caster Sugar",
      "strIngredient11": "Self-raising Flour",
      "strIngredient12": "Almonds",
      "strIngredient13": "Baking Powder",
      "strIngredient14": "Eggs",
      "strIngredient15": "Vanilla Extract",
      "strMeasure1": "175g",
      "strMeasure2": "175g",
      "strMeasure3": "140g",
      "strMeasure4": "50g",
      "strMeasure5": "½ tsp",
      "strMeasure6": "3 Medium",
      "strMeasure7": "½ tsp",
      "strMeasure8": "¼ teaspoon",
      "strMeasure9": "175g",
      "strMeasure10": "175g",
      "strMeasure11": "140g",
      "strMeasure12": "50g",
      "id": 2
    },
    {
      "idMeal": "53046",
      "strMeal": "Portuguese custard tarts",
      "strCategory": "Dessert",
      "strInstructions": "STEP 1\r\nRoll the pastry\r\nMix the flour and icing sugar, and use this to dust the work surface. Roll the pastry out to make a 45 x 30cm rectangle. Roll up lengthways to create a long sausage shape.\r\n\r\nSTEP 2\r\nCutting pastry into rounds\r\nCut the pastry into 24 wheels, about 1-2cm thick.\r\n\r\nSTEP 3\r\nRoll out each pastry portion\r\nRoll each wheel lightly with the rolling pin to fit 2 x 12-hole non-stick fairy cake tins.\r\n\r\nSTEP 4\r\nPress pastry into the tin\r\nPress the pastry circles into the tins and mould into the tins to make thin cases. Chill until needed.\r\n\r\nSTEP 5\r\nMake the infused syrup\r\nHeat the oven to 220C/fan 200C/gas 7. Make a sugar syrup by bringing the sugar, 200ml water, lemon zest and cinnamon stick to the boil. Reduce until syrupy, allow to cool, then remove the cinnamon and lemon. Whisk the eggs, egg yolks and cornflour until smooth in another large pan.\r\n\r\nSTEP 6\r\nMaking custard\r\nHeat the milk and vanilla pod seeds in a separate pan until just below the boil. Gradually pour the hot milk over the eggs and cornflour, then cook on a low heat, continually whisking.\r\n\r\nSTEP 7\r\nAdd syrup to custard\r\nAdd the cooled sugar syrup to the custard and whisk until thickened slightly.\r\n\r\nSTEP 8\r\nPour custard into the tins\r\nPour the custard through a sieve. Pour into the pastry cases and bake for 15 minutes until the pastry is golden and the custard has darkened.\r\n\r\nSTEP 9\r\ncool and dust with icing sugar\r\nCool completely in the tins then sift over icing sugar and ground cinnamon to serve.\r\n\r\n\r\n\r\n ",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/vmz7gl1614350221.jpg",
      "strYoutube": "https://www.youtube.com/watch?v=lWLCxui1Mw8",
      "strIngredient1": "Plain Flour",
      "strIngredient2": "Icing Sugar",
      "strIngredient3": "Puff Pastry",
      "strIngredient4": "Caster Sugar",
      "strIngredient5": "Lemon Zest",
      "strIngredient6": "Cinnamon",
      "strIngredient7": "Eggs",
      "strIngredient8": "Egg Yolks",
      "strIngredient9": "Corn Flour",
      "strIngredient10": "Whole Milk",
      "strIngredient11": "Vanilla",
      "strIngredient12": "Cinnamon",
      "strIngredient13": "",
      "strIngredient14": "",
      "strIngredient15": "",
      "strMeasure1": "2 tbs",
      "strMeasure2": "2 tbs",
      "strMeasure3": "375g",
      "strMeasure4": "250g",
      "strMeasure5": "2 strips",
      "strMeasure6": "1 Stick",
      "strMeasure7": "2",
      "strMeasure8": "4",
      "strMeasure9": "50g",
      "strMeasure10": "500ml",
      "strMeasure11": "Pod of",
      "strMeasure12": "To serve",
      "id": 3
    }
  ],
  "recipes": [
    {
      "strMeal": "William Gotterer",
      "strIngredients": "wdfsfd",
      "strInstructions": "sdf",
      "strMealThumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Shoyu_Ramen.jpg/1200px-Shoyu_Ramen.jpg",
      "id": 1
    },
    {
      "strMeal": "William Gotterer",
      "strIngredients": "1 body",
      "strInstructions": "asfaf",
      "strMealThumb": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Shoyu_Ramen.jpg/1200px-Shoyu_Ramen.jpg",
      "id": 2
    }
  ]
}