{
  "meals": [
    {
      "idMeal": "52996",
      "strMeal": "French Onion Chicken with Roasted Carrots & Mashed Potatoes",
      "strCategory": "Chicken",
      "strInstructions": "1\r\n\r\nPreheat oven to 425 degrees. Wash and dry all produce. Trim, peel, and cut carrots on a diagonal into ¼-inch-thick pieces. Dice potatoes into ½-inch pieces. Halve, peel, and thinly slice onion.\r\n\r\n2\r\n\r\nToss carrots on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 15-20 minutes.\r\n\r\n3\r\n\r\nMeanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 12-15 minutes. Drain and return potatoes to pot; cover to keep warm.\r\n\r\n4\r\n\r\nWhile potatoes cook, heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring occasionally, until lightly browned and softened, 8-10 minutes. Sprinkle with 1 tsp sugar (2 tsp for 4 servings). Stir in stock concentrate and 2 TBSP water (¼ cup for 4); season with salt and pepper. Cook until jammy, 2-3 minutes more. Turn off heat; transfer to a small bowl. Wash out pan.\r\n\r\n5\r\n\r\nPat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in pan used for onion over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. In the last 1-2 minutes of cooking, top with caramelized onion and cheese. Cover pan until cheese melts. (If your pan doesn’t have a lid, cover with a baking sheet!)\r\n\r\n6\r\n\r\nHeat pot with drained potatoes over low heat; mash with sour cream, 2 TBSP butter (4 TBSP for 4 servings), salt, pepper, and a splash of water (or milk, for extra richness) until smooth. Divide chicken, roasted carrots, and mashed potatoes between plates.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/b5ft861583188991.jpg",
      "strYoutube": "",
      "strIngredient1": "Chicken Breasts",
      "strIngredient2": "Carrots",
      "strIngredient3": "Small Potatoes",
      "strIngredient4": "Onion",
      "strIngredient5": "Beef Stock",
      "strIngredient6": "Mozzarella",
      "strIngredient7": "Sour Cream",
      "strIngredient8": "Butter",
      "strIngredient9": "Sugar",
      "strIngredient10": "Vegetable Oil",
      "strIngredient11": "Salt",
      "strIngredient12": "Pepper",
      "strIngredient13": "",
      "strIngredient14": "",
      "strIngredient15": "",
      "strMeasure1": "2",
      "strMeasure2": "12 ounces",
      "strMeasure3": "5",
      "strMeasure4": "1",
      "strMeasure5": "1",
      "strMeasure6": "1 1/2 cup ",
      "strMeasure7": "2 tbsp",
      "strMeasure8": " ",
      "strMeasure9": " ",
      "strMeasure10": " ",
      "strMeasure11": " ",
      "strMeasure12": " ",
      "id": 1
    },
    {
      "idMeal": "52856",
      "strMeal": "Choc Chip Pecan Pie",
      "strCategory": "Dessert",
      "strInstructions": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg",
      "strYoutube": "https://www.youtube.com/watch?v=fDpoT0jvg4Y",
      "strIngredient1": "Plain Flour",
      "strIngredient2": "Butter",
      "strIngredient3": "Cream Cheese",
      "strIngredient4": "Icing Sugar",
      "strIngredient5": "Butter",
      "strIngredient6": "Maple Syrup",
      "strIngredient7": "Light Brown Soft Sugar",
      "strIngredient8": "Dark Brown Soft Sugar",
      "strIngredient9": "Eggs",
      "strIngredient10": "Vanilla Extract",
      "strIngredient11": "Pecan Nuts",
      "strIngredient12": "Dark Chocolate Chips",
      "strIngredient13": "",
      "strIngredient14": "",
      "strIngredient15": "",
      "strMeasure1": "300g",
      "strMeasure2": "75g",
      "strMeasure3": "100g ",
      "strMeasure4": "1 tbls",
      "strMeasure5": "150g",
      "strMeasure6": "200ml",
      "strMeasure7": "250g",
      "strMeasure8": "100g ",
      "strMeasure9": "4",
      "strMeasure10": "1 tsp ",
      "strMeasure11": "400g",
      "strMeasure12": "200g",
      "id": 2
    }
  ],
  "recipes": [
    {
      "strMeal": "donut burger",
      "strIngredients": "donuuuutttttttttt",
      "strInstructions": "eattttttt ",
      "strMealThumb": "https://i.pinimg.com/originals/8d/e4/70/8de470c254d49a288cfaf91ba3e2c012.jpg",
      "id": 1
    }
  ]
}